CSI API ETABS v1
cPropMaterial.GetMaterial Method
 Retrieves some basic material property data.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetMaterial(
	string Name,
	ref eMatType MatType,
	ref int Color,
	ref string Notes,
	ref string GUID
)
Function GetMaterial (
	Name As String,
	ByRef MatType As eMatType,
	ByRef Color As Integer,
	ByRef Notes As String,
	ByRef GUID As String
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim MatType As eMatType
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetMaterial(Name,
	MatType, Color, Notes, GUID)
int GetMaterial(
	String^ Name,
	eMatType% MatType,
	int% Color,
	String^% Notes,
	String^% GUID
)
abstract GetMaterial :
        Name : string *
        MatType : eMatType byref *
        Color : int byref *
        Notes : string byref *
        GUID : string byref -> int
Parameters
Name
Type: System.String
The name of an existing material property.
MatType
Type: ETABSv1.eMatType
This is one of the items in the eMatType enumeration.
Color
Type: System.Int32
Notes
Type: System.String
GUID
Type: System.String
The GUID (global unique identifier), if any, assigned to the material.
Return Value
Type: Int32
Returns zero if the material is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim MatType As eMatType
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("Steel", eMatType.Steel, -1, "API example test", "Default")
   'get basic material property data
       ret = SapModel.PropMaterial.GetMaterial("Steel", MatType, Color, Notes, GUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace